export const regions =
[
  {
    name: "Центральный Федеральный Округ",
    code: 'cfo',
    coordinates: [54.873745, 38.064718],
    regions: [
      {
        id: 20,
        name: "Белгородская область",
        coordinates: [50.872231, 37.303198],
      },
      {
        coordinates: [52.909192, 33.422197],
        id: 1,
        name: "Брянская область"
      },
      {
        coordinates: [55.904195, 40.898894],
        id: 2,
        name: "Владимирская область"
      },
      {
        coordinates: [50.970898, 40.233395],
        id: 3,
        name: "Воронежская область"
      },
      {
        coordinates: [56.967836, 41.966406],
        id: 4,
        name: "Ивановская область"
      },
      {
        coordinates: [54.3718, 35.445185],
        id: 5,
        name: "Калужская область"
      },
      {
        coordinates: [58.456003, 43.788495],
        id: 6,
        name: "Костромская область"
      },
      {
        coordinates: [51.535008, 36.121347],
        id: 7,
        name: "Курская область"
      },
      {
        coordinates: [52.864468, 39.147637],
        id: 8,
        name: "Липецкая область"
      },
      {
        coordinates: [55.531127, 38.874756],
        id: 9,
        name: "Московская область"
      },
      {
        coordinates: [52.781455, 36.481042],
        id: 10,
        name: "Орловская область"
      },
      {
        coordinates: [54.559725, 40.950331],
        id: 11,
        name: "Рязанская область"
      },
      {
        coordinates: [54.956192, 32.998543], id: 12,
        name: "Смоленская область"
      },
      {
        coordinates: [52.474699, 41.592249],
        id: 13,
        name: "Тамбовская область"
      },
      {
        coordinates: [57.093033, 34.706195],
        id: 14,
        name: "Тверская область"
      },
      {
        coordinates: [53.888064, 37.575693],
        id: 15,
        name: "Тульская область"
      },
      {
        coordinates: [57.817361, 39.105138],
        id: 16,
        name: "Ярославская область"
      },
      {
        coordinates: [55.753215, 37.622504],
        id: 17,
        name: "Москва"
      }
    ]
  },
  {
    name: "Северо-Западный Федеральный Округ",
    code: 'szfo',
    coordinates: [61.469749, 36.498137],
    regions: [
      {
        coordinates: [63.621324, 33.232608],
        id: 20,
        name: "Республика Карелия"
      },
      {
        coordinates: [64.125463, 54.789669],
        id: 1,
        name: "Республика Коми"
      },
      {
        coordinates: [63.637517, 43.336661],
        id: 2,
        name: "Архангельская область"
      },
      {
        coordinates: [60.138988, 44.049618], id: 3,
        name: "Вологодская область"
      },
      {
        coordinates: [54.56009, 21.218944],
        id: 4,
        name: "Калининградская область"
      },
      {
        coordinates: [59.337013, 29.608975],
        id: 5,
        name: "Ленинградская область"
      },
      {
        coordinates: [68.004154, 35.010051],
        id: 6,
        name: "Мурманская область"
      },
      {
        coordinates: [58.307715, 32.490222],
        id: 7,
        name: "Новгородская область"
      },
      {
        coordinates: [57.236486, 29.236911],
        id: 8,
        name: "Псковская область"
      },
      {
        coordinates: [59.938951, 30.315635], id: 9,
        name: "Санкт-Петербург"
      },
      {
        coordinates: [67.714212, 54.365062],
        id: 10,
        name: "Ненецкий автономный округ"
      }
    ]
  },
  {
    name: "Южный Федеральный Округ",
    code: 'yfo',
    coordinates: [48.622558, 43.166151],
    regions: [
      {
        coordinates: [44.429866, 40.252969],
        id: 20,
        name: "Республика Адыгея"
      },
      {
        coordinates: [46.414024, 45.325701],
        id: 1,
        name: "Республика Калмыкия"
      },
      {
        coordinates: [45.389194, 33.993751],
        id: 2,
        name: "Республика Крым"
      },
      {
        coordinates: [45.544904, 39.610422],
        id: 3,
        name: "Краснодарский край"
      },
      {
        coordinates: [46.851463, 47.466189],
        id: 4,
        name: "Астраханская область"
      },
      {
        coordinates: [49.615821, 44.151406],
        id: 5,
        name: "Волгоградская область"
      },
      {
        coordinates: [47.728732, 41.268128],
        id: 6,
        name: "Ростовская область"
      },
      {
        coordinates: [44.556972, 33.526402],
        id: 7,
        name: "Севастополь"
      }
    ]
  },
  {
    name: "Северо-Кавказский Федеральный Округ",
    code: 'skfo',
    coordinates: [43.898977, 44.693045],
    regions: [
      {
        coordinates: [42.259793, 47.095742], id: 20,
        name: "Республика Дагестан"
      },
      {
        coordinates: [43.10359, 45.054581],
        id: 1,
        name: "Республика Ингушетия"
      },
      {
        coordinates: [43.494396, 43.408274],
        id: 2,
        name: "Кабардино-Балкарская Республика"
      },
      {
        coordinates: [43.770947, 41.753928],
        id: 3,
        name: "Карачаево-Черкесская Республика"
      },
      {
        coordinates: [43.092669, 44.262033],
        id: 4,
        name: "Республика Северная Осетия"
      },
      {
        coordinates: [43.305784, 45.747667],
        id: 5,
        name: "Чеченская республика"
      },
      {
        coordinates: [44.953551, 43.344521],
        id: 6,
        name: "Ставропольский край"
      }
    ]
  },
  {
    name: "Приволжский Федеральный Округ",
    code: 'pfo',
    coordinates: [55.485362, 51.524283],
    regions: [
      {
        coordinates: [54.2715, 56.525537],
        id: 20,
        name: "Республика Башкортостан"
      },
      {
        coordinates: [56.485739, 48.197858],
        id: 1,
        name: "Республика Марий Эл"
      },
      {
        coordinates: [54.205758, 44.319669],
        id: 2,
        name: "Республика Мордовия"
      },
      {
        coordinates: [55.350336, 50.911013],
        id: 3,
        name: "Республика Татарстан"
      },
      {
        coordinates: [57.166784, 52.796972],
        id: 4,
        name: "Удмуртская Республика"
      },
      {
        coordinates: [55.492023, 47.086875],
        id: 5,
        name: "Чувашская республика"
      },
      {
        coordinates: [59.117698, 56.225679],
        id: 6,
        name: "Пермский край"
      },
      {
        coordinates: [58.344108, 49.69543],
        id: 7,
        name: "Кировская область"
      },
      {
        coordinates: [56.595648, 44.279559],
        id: 8,
        name: "Нижегородская область"
      },
      {
        coordinates: [52.743528, 53.498682],
        id: 9,
        name: "Оренбургская область"
      },
      {
        coordinates: [53.240932, 43.946823],
        id: 10,
        name: "Пензенская область"
      },
      {
        coordinates: [53.452932, 50.34431],
        id: 11,
        name: "Самарская область"
      },
      {
        coordinates: [51.578529, 46.797223],
        id: 12,
        name: "Саратовская область"
      },
      {
        coordinates: [53.891057, 47.606533],
        id: 13,
        name: "Ульяновская область"
      }
    ]
  },
  {
    name: "Уральский Федеральный Округ",
    code: 'urfo',
    coordinates: [60.519886, 64.350447],
    regions: [
      {
        coordinates: [55.448347, 64.809405],
        id: 20,
        name: "Курганская область"
      },
      {
        coordinates: [58.586755, 61.530761],
        id: 1,
        name: "Свердловская область"
      },
      {
        coordinates: [57.541821, 68.096045],
        id: 2,
        name: "Тюменская область"
      },
      {
        coordinates: [54.446199, 60.395641],
        id: 3,
        name: "Челябинская область"
      },
      {
        coordinates: [61.588912, 65.897508],
        id: 4,
        name: "Ханты-Мансийский автономный округ — Югра"
      },
      {
        coordinates: [67.808603, 75.199562],
        id: 5,
        name: "Ямало-Ненецкий автономный округ"
      }
    ]
  },
  {
    name: "Сибирский Федеральный Округ",
    code: 'sfo',
    coordinates: [61.833048, 96.962463],
    regions: [
      {
        coordinates: [50.73624, 87.015454],
        id: 20,
        name: "Республика Алтай"
      },
      {
        coordinates: [51.584332, 94.793085],
        id: 1,
        name: "Республика Тыва"
      },
      {
        coordinates: [53.386357, 89.897078],
        id: 2,
        name: "Республика Хакасия"
      },
      {
        coordinates: [52.129671, 82.530013],
        id: 3,
        name: "Алтайский край"
      },
      {
        coordinates: [67.236779, 95.968477],
        id: 4,
        name: "Красноярский край"
      },
      {
        coordinates: [57.100294, 106.363305],
        id: 5,
        name: "Иркутская область"
      },
      {
        coordinates: [54.89794, 86.990382],
        id: 6,
        name: "Кемеровская область"
      },
      {
        coordinates: [55.582396, 79.264861],
        id: 7,
        name: "Новосибирская область"
      },
      {
        coordinates: [56.103472, 73.344416],
        id: 8,
        name: "Омская область"
      },
      {
        coordinates: [58.949193, 78.63728],
        id: 9,
        name: "Томская область"
      }
    ]
  },
  {
    name: "Дальневосточный Федеральный Округ",
    code: 'dfo',
    coordinates: [63.629508, 124.131856],
    regions: [
      {
        coordinates: [54.544222, 112.348699],
        id: 20,
        name: "Республика Бурятия"
      },
      {
        coordinates: [65.061073, 119.845652],
        id: 1,
        name: "Республика Якутия"
      },
      {
        coordinates: [52.847258, 116.200424],
        id: 2,
        name: "Забайкальский край"
      },
      {
        coordinates: [61.350179, 169.782981],
        id: 3,
        name: "Камчатский край"
      },
      {
        coordinates: [45.04198, 134.709375],
        id: 4,
        name: "Приморский край"
      },
      {
        coordinates: [51.695886, 136.637034],
        id: 5,
        name: "Хабаровский край"
      },
      {
        coordinates: [53.413341, 127.728064],
        id: 6,
        name: "Амурская область"
      },
      {
        coordinates: [62.575815, 154.036835],
        id: 7,
        name: "Магаданская область"
      },
      {
        coordinates: [50.150926, 142.750797],
        id: 8,
        name: "Сахалинская область"
      },
      {
        coordinates: [48.522902, 132.257612],
        id: 9,
        name: "Еврейская автономная область"
      },
      {
        coordinates: [65.982613, 174.432311],
        id: 10,
        name: "Чукотский автономный округ"
      }
    ]
  }
];

export const degrees = [
  {
    code: 'kandNauk',
    name: 'Кандидат наук',
  },
  {
    code: 'doctor',
    name: 'Доктор наук'
  }
];

export const majors = [
  {
    code: 'korpcy',
    name: 'Коррекционная психология',
  },
  {
    code: 'korped',
    name: 'Коррекционная педагогика',
  }
];

export const titles = [
  {
    code: 'DOCSHENT',
    name: 'Доцент',
  },
  {
    code: 'PROFESSOR',
    name: 'Профессор',
  }
]