export const regions =
[
  {
    name: "Центральный Федеральный Округ",
    regions: [
      {
        id: 0,
        name: "Белгородская область"
      },
      {
        id: 1,
        name: "Брянская область"
      },
      {
        id: 2,
        name: "Владимирская область"
      },
      {
        id: 3,
        name: "Воронежская область"
      },
      {
        id: 4,
        name: "Ивановская область"
      },
      {
        id: 5,
        name: "Калужская область"
      },
      {
        id: 6,
        name: "Костромская область"
      },
      {
        id: 7,
        name: "Курская область"
      },
      {
        id: 8,
        name: "Липецкая область"
      },
      {
        id: 9,
        name: "Московская область"
      },
      {
        id: 10,
        name: "Орловская область"
      },
      {
        id: 11,
        name: "Рязанская область"
      },
      {
        id: 12,
        name: "Смоленская область"
      },
      {
        id: 13,
        name: "Тамбовская область"
      },
      {
        id: 14,
        name: "Тверская область"
      },
      {
        id: 15,
        name: "Тульская область"
      },
      {
        id: 16,
        name: "Ярославская область"
      },
      {
        id: 17,
        name: "Москва"
      }
    ]
  },
  {
    name: "Северо-Западный Федеральный Округ",
    regions: [
      {
        id: 0,
        name: "Республика Карелия"
      },
      {
        id: 1,
        name: "Республика Коми"
      },
      {
        id: 2,
        name: "Архангельская область"
      },
      {
        id: 3,
        name: "Вологодская область"
      },
      {
        id: 4,
        name: "Калининградская область"
      },
      {
        id: 5,
        name: "Ленинградская область"
      },
      {
        id: 6,
        name: "Мурманская область"
      },
      {
        id: 7,
        name: "Новгородская область"
      },
      {
        id: 8,
        name: "Псковская область"
      },
      {
        id: 9,
        name: "Санкт-Петербург"
      },
      {
        id: 10,
        name: "Ненецкий автономный округ"
      }
    ]
  },
  {
    name: "Южный Федеральный Округ",
    regions: [
      {
        id: 0,
        name: "Республика Адыгея"
      },
      {
        id: 1,
        name: "Республика Калмыкия"
      },
      {
        id: 2,
        name: "Республика Крым"
      },
      {
        id: 3,
        name: "Краснодарский край"
      },
      {
        id: 4,
        name: "Астраханская область"
      },
      {
        id: 5,
        name: "Волгоградская область"
      },
      {
        id: 6,
        name: "Ростовская область"
      },
      {
        id: 7,
        name: "Севастополь"
      }
    ]
  },
  {
    name: "Северо-Кавказский Федеральный Округ",
    regions: [
      {
        id: 0,
        name: "Республика Дагестан"
      },
      {
        id: 1,
        name: "Республика Ингушетия"
      },
      {
        id: 2,
        name: "Кабардино-Балкарская Республика"
      },
      {
        id: 3,
        name: "Карачаево-Черкесская Республика"
      },
      {
        id: 4,
        name: "Республика Северная Осетия"
      },
      {
        id: 5,
        name: "Чеченская республика"
      },
      {
        id: 6,
        name: "Ставропольский край"
      }
    ]
  },
  {
    name: "Приволжский Федеральный Округ",
    regions: [
      {
        id: 0,
        name: "Республика Башкортостан"
      },
      {
        id: 1,
        name: "Республика Марий Эл"
      },
      {
        id: 2,
        name: "Республика Мордовия"
      },
      {
        id: 3,
        name: "Республика Татарстан"
      },
      {
        id: 4,
        name: "Удмуртская Республика"
      },
      {
        id: 5,
        name: "Чувашская республика"
      },
      {
        id: 6,
        name: "Пермский край"
      },
      {
        id: 7,
        name: "Кировская область"
      },
      {
        id: 8,
        name: "Нижегородская область"
      },
      {
        id: 9,
        name: "Оренбургская область"
      },
      {
        id: 10,
        name: "Пензенская область"
      },
      {
        id: 11,
        name: "Самарская область"
      },
      {
        id: 12,
        name: "Саратовская область"
      },
      {
        id: 13,
        name: "Ульяновская область"
      }
    ]
  },
  {
    name: "Уральский Федеральный Округ",
    regions: [
      {
        id: 0,
        name: "Курганская область"
      },
      {
        id: 1,
        name: "Свердловская область"
      },
      {
        id: 2,
        name: "Тюменская область"
      },
      {
        id: 3,
        name: "Челябинская область"
      },
      {
        id: 4,
        name: "Ханты-Мансийский автономный округ — Югра"
      },
      {
        id: 5,
        name: "Ямало-Ненецкий автономный округ"
      }
    ]
  },
  {
    name: "Сибирский Федеральный Округ",
    regions: [
      {
        id: 0,
        name: "Республика Алтай"
      },
      {
        id: 1,
        name: "Республика Тыва"
      },
      {
        id: 2,
        name: "Республика Хакасия"
      },
      {
        id: 3,
        name: "Алтайский край"
      },
      {
        id: 4,
        name: "Красноярский край"
      },
      {
        id: 5,
        name: "Иркутская область"
      },
      {
        id: 6,
        name: "Кемеровская область"
      },
      {
        id: 7,
        name: "Новосибирская область"
      },
      {
        id: 8,
        name: "Омская область"
      },
      {
        id: 9,
        name: "Томская область"
      }
    ]
  },
  {
    name: "Дальневосточный Федеральный Округ",
    regions: [
      {
        id: 0,
        name: "Республика Бурятия"
      },
      {
        id: 1,
        name: "Республика Якутия"
      },
      {
        id: 2,
        name: "Забайкальский край"
      },
      {
        id: 3,
        name: "Камчатский край"
      },
      {
        id: 4,
        name: "Приморский край"
      },
      {
        id: 5,
        name: "Хабаровский край"
      },
      {
        id: 6,
        name: "Амурская область"
      },
      {
        id: 7,
        name: "Магаданская область"
      },
      {
        id: 8,
        name: "Сахалинская область"
      },
      {
        id: 9,
        name: "Еврейская автономная область"
      },
      {
        id: 10,
        name: "Чукотский автономный округ"
      }
    ]
  }
];