export const news = [
  {
    id: 1,
    title: 'Новость первая',
    date: '30-10-2020',
    text: 'Ну тут будет текст, но пока его нигде показывать не надо',
  },
  {
    id: 2,
    title: 'Новость вторая',
    date: '30-10-2020',
    text: 'Ну тут будет текст, но пока его нигде показывать не надо',
  },
  {
    id: 3,
    title: 'Новость третья',
    date: '30-10-2020',
    text: 'Ну тут будет текст, но пока его нигде показывать не надо',
  },
  {
    id: 4,
    title: 'Новость четвертая',
    date: '30-10-2020',
    text: 'Ну тут будет текст, но пока его нигде показывать не надо',
  },
  {
    id: 5,
    title: 'Новость пятая',
    date: '30-10-2020',
    text: 'Ну тут будет текст, но пока его нигде показывать не надо',
  },
  {
    id: 6,
    title: 'Новость шестая',
    date: '30-10-2020',
    text: 'Ну тут будет текст, но пока его нигде показывать не надо',
  },
];